Tutorial/20221223201433-build_oci_containers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-14 Fri 07:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Build OCI containers in Nixos</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Build OCI containers in Nixos</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdb48b6f"><span class="todo TODO">TODO</span> Build OCI containers in nix&#xa0;&#xa0;&#xa0;<span class="tag"><span class="docker">docker</span>&#xa0;<span class="podman">podman</span>&#xa0;<span class="oci">oci</span></span></a>
<ul>
<li><a href="#org7422e9a">Main workflow</a>
<ul>
<li><a href="#org2f38f46">Examples</a></li>
<li><a href="#org5e40fdc">Star intel Example</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgdb48b6f" class="outline-2">
<h2 id="orgdb48b6f"><span class="todo TODO">TODO</span> Build OCI containers in nix&#xa0;&#xa0;&#xa0;<span class="tag"><span class="docker">docker</span>&#xa0;<span class="podman">podman</span>&#xa0;<span class="oci">oci</span></span></h2>
<div class="outline-text-2" id="text-orgdb48b6f">
<p>
finish this!
<a href="https://nixos.org/manual/nixpkgs/stable/#sec-pkgs-dockerTools">https://nixos.org/manual/nixpkgs/stable/#sec-pkgs-dockerTools</a>
<a href="https://github.com/NixOS/nixpkgs/blob/master/pkgs/build-support/docker/examples.nix">https://github.com/NixOS/nixpkgs/blob/master/pkgs/build-support/docker/examples.nix</a>
</p>


<p>
OCI containers are a poorly documented aspect of nixos (as with most of it), in this page i will show you how to build and run OCI (docker) containers in nixos.
</p>

<p>
Most of this document is lifted from <a href="https://github.com/NixOS/nixpkgs/blob/master/pkgs/build-support/docker/examples.nix">this</a> helpful nix source.
</p>
</div>


<div id="outline-container-org7422e9a" class="outline-3">
<h3 id="org7422e9a">Main workflow</h3>
<div class="outline-text-3" id="text-org7422e9a">
<p>
Since nix changes how everything works, this includes how you packages and use OCI containers
I will assume docker in this entry, becuase I had issues with podman.
</p>

<ol class="org-ol">
<li>Create your docker-name.nix (or default.nix)</li>
<li>after you are done build it</li>
<li>load the derivation result into docker</li>
<li>Run the docker container</li>
</ol>

<p>
You can load and build that the same as such:
</p>
<div class="org-src-container">
<pre class="src src-shell">docker load &lt; $<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">nix-build default.nix</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org2f38f46" class="outline-4">
<h4 id="org2f38f46">Examples</h4>
<div class="outline-text-4" id="text-org2f38f46">
<p>
Here is a very basic oci image
</p>

<div class="org-src-container">
<pre class="src src-nix">buildImage {
    <span style="color: #df85ff;">name</span> = <span style="color: #7984D1;">"bash"</span>;
    <span style="color: #df85ff;">tag</span> = <span style="color: #7984D1;">"latest"</span>;
    <span style="color: #df85ff;">copyToRoot</span> = pkgs.buildEnv {
      <span style="color: #df85ff;">name</span> = <span style="color: #7984D1;">"image-root"</span>;
      <span style="color: #df85ff;">paths</span> = [ pkgs.bashInteractive ];
      <span style="color: #df85ff;">pathsToLink</span> = [ <span style="color: #7984D1;">"/bin"</span> ];
    }
}
</pre>
</div>
</div>

<ul class="org-ul">
<li><a id="orgf42f028"></a>Service<br />
<div class="outline-text-5" id="text-orgf42f028">
<p>
Redis service example
</p>
<div class="org-src-container">
<pre class="src src-nix"><span style="color: #df85ff;">redis</span> = buildImage {
    <span style="color: #df85ff;">name</span> = <span style="color: #7984D1;">"redis"</span>;
    <span style="color: #df85ff;">tag</span> = <span style="color: #7984D1;">"latest"</span>;

    <span style="color: #546A90;"># for example's sake, we can layer redis on top of bash or debian</span>
    <span style="color: #df85ff;">fromImage</span> = bash;
    <span style="color: #546A90;"># fromImage = debian;</span>

    <span style="color: #df85ff;">copyToRoot</span> = pkgs.buildEnv {
      <span style="color: #df85ff;">name</span> = <span style="color: #7984D1;">"image-root"</span>;
      <span style="color: #df85ff;">paths</span> = [ pkgs.redis ];
      <span style="color: #df85ff;">pathsToLink</span> = [ <span style="color: #7984D1;">"/bin"</span> ];
    };

    <span style="color: #df85ff;">runAsRoot</span> = <span style="color: #7984D1;">''</span>
<span style="color: #7984D1;">      mkdir -p /data</span>
<span style="color: #7984D1;">    ''</span>;

    <span style="color: #df85ff;">config</span> = {
      <span style="color: #df85ff;">Cmd</span> = [ <span style="color: #7984D1;">"/bin/redis-server"</span> ];
      <span style="color: #df85ff;">WorkingDir</span> = <span style="color: #7984D1;">"/data"</span>;
      <span style="color: #df85ff;">Volumes</span> = {
        <span style="color: #7984D1;">"/data"</span> = {};
      };
    };
  };
</pre>
</div>

<p>
Nginx
</p>

<div class="org-src-container">
<pre class="src src-nix">  <span style="color: #df85ff;">nginx</span> = <span style="color: #ff2afc; font-weight: bold;">let</span>
    <span style="color: #df85ff;">nginxPort</span> = <span style="color: #7984D1;">"80"</span>;
    <span style="color: #df85ff;">nginxConf</span> = pkgs.writeText <span style="color: #7984D1;">"nginx.conf"</span> <span style="color: #7984D1;">''</span>
<span style="color: #7984D1;">      user nobody nobody;</span>
<span style="color: #7984D1;">      daemon off;</span>
<span style="color: #7984D1;">      error_log /dev/stdout info;</span>
<span style="color: #7984D1;">      pid /dev/null;</span>
<span style="color: #7984D1;">      events {}</span>
<span style="color: #7984D1;">      http {</span>
<span style="color: #7984D1;">        access_log /dev/stdout;</span>
<span style="color: #7984D1;">        server {</span>
<span style="color: #7984D1;">          listen </span><span style="color: #ff2afc; font-weight: bold;">${</span>nginxPort<span style="color: #ff2afc; font-weight: bold;">}</span><span style="color: #7984D1;">;</span>
<span style="color: #7984D1;">          index index.html;</span>
<span style="color: #7984D1;">          location / {</span>
<span style="color: #7984D1;">            root </span><span style="color: #ff2afc; font-weight: bold;">${</span>nginxWebRoot<span style="color: #ff2afc; font-weight: bold;">}</span><span style="color: #7984D1;">;</span>
<span style="color: #7984D1;">          }</span>
<span style="color: #7984D1;">        }</span>
<span style="color: #7984D1;">      }</span>
<span style="color: #7984D1;">    ''</span>;
    <span style="color: #df85ff;">nginxWebRoot</span> = pkgs.writeTextDir <span style="color: #7984D1;">"index.html"</span> <span style="color: #7984D1;">''</span>
<span style="color: #7984D1;">      &lt;html&gt;&lt;body&gt;&lt;h1&gt;Hello from NGINX&lt;/h1&gt;&lt;/body&gt;&lt;/html&gt;</span>
<span style="color: #7984D1;">    ''</span>;
  <span style="color: #ff2afc; font-weight: bold;">in</span>
  buildLayeredImage {
    <span style="color: #df85ff;">name</span> = <span style="color: #7984D1;">"nginx-container"</span>;
    <span style="color: #df85ff;">tag</span> = <span style="color: #7984D1;">"latest"</span>;
    <span style="color: #df85ff;">contents</span> = [
      fakeNss
      pkgs.nginx
    ];

    <span style="color: #df85ff;">extraCommands</span> = <span style="color: #7984D1;">''</span>
<span style="color: #7984D1;">      mkdir -p tmp/nginx_client_body</span>
<span style="color: #7984D1;">      # nginx still tries to read this directory even if error_log</span>
<span style="color: #7984D1;">      # directive is specifying another file :/</span>
<span style="color: #7984D1;">      mkdir -p var/log/nginx</span>
<span style="color: #7984D1;">    ''</span>;

    <span style="color: #df85ff;">config</span> = {
      <span style="color: #df85ff;">Cmd</span> = [ <span style="color: #7984D1;">"nginx"</span> <span style="color: #7984D1;">"-c"</span> nginxConf ];
      <span style="color: #df85ff;">ExposedPorts</span> = {
        <span style="color: #7984D1;">"</span><span style="color: #ff2afc; font-weight: bold;">${</span>nginxPort<span style="color: #ff2afc; font-weight: bold;">}</span><span style="color: #7984D1;">/tcp"</span> = {};
      };
    };
  };

</pre>
</div>
</div>
</li>

<li><a id="orgc9cda3e"></a>Pulling Images<br />
<div class="outline-text-5" id="text-orgc9cda3e">
<p>
Example of pulling a Docker Images
</p>

<div class="org-src-container">
<pre class="src src-nix"><span style="color: #df85ff;">nixFromDockerHub</span> = pullImage {
    <span style="color: #df85ff;">imageName</span> = <span style="color: #7984D1;">"nixos/nix"</span>;
    <span style="color: #df85ff;">imageDigest</span> = <span style="color: #7984D1;">"sha256:85299d86263a3059cf19f419f9d286cc9f06d3c13146a8ebbb21b3437f598357"</span>;
    <span style="color: #df85ff;">sha256</span> = <span style="color: #7984D1;">"19fw0n3wmddahzr20mhdqv6jkjn1kanh6n2mrr08ai53dr8ph5n7"</span>;
    <span style="color: #df85ff;">finalImageTag</span> = <span style="color: #7984D1;">"2.2.1"</span>;
    <span style="color: #df85ff;">finalImageName</span> = <span style="color: #7984D1;">"nix"</span>;
};
</pre>
</div>
</div>
</li>

<li><a id="org35af17f"></a>Add to image<br />
<div class="outline-text-5" id="text-org35af17f">
<p>
Add Some packages to an existing image.
</p>
<div class="org-src-container">
<pre class="src src-nix"><span style="color: #df85ff;">onTopOfPulledImage</span> = buildImage {
    <span style="color: #df85ff;">name</span> = <span style="color: #7984D1;">"onTopOfPulledImage"</span>;
    <span style="color: #df85ff;">tag</span> = <span style="color: #7984D1;">"latest"</span>;
    <span style="color: #df85ff;">fromImage</span> = nixFromDockerHub;
    <span style="color: #df85ff;">copyToRoot</span> = pkgs.buildEnv {
      <span style="color: #df85ff;">name</span> = <span style="color: #7984D1;">"image-root"</span>;
      <span style="color: #df85ff;">pathsToLink</span> = [ <span style="color: #7984D1;">"/bin"</span> ];
      <span style="color: #df85ff;">paths</span> = [ pkgs.hello ];
    };
  };
</pre>
</div>
</div>
</li>
</ul>
</div>



<div id="outline-container-org5e40fdc" class="outline-4">
<h4 id="org5e40fdc">Star intel Example</h4>
<div class="outline-text-4" id="text-org5e40fdc">
<p>
Heres a real example of couchdb that runs <a href="../2022-05-28-030619-star_intel.html#ID-78157cd5-9681-4a64-b5c7-0f2b415cd446">star intel</a>.
</p>
</div>
<ul class="org-ul">
<li><a id="org2285cdf"></a><span class="todo TODO">TODO</span> Add my image stuff when i get it working!<br /></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.6.1)</p>
<p class="validation"></p>
</div>
</body>
</html>